// ООП Лабораторна робота №3

public class Lab3{
    public static void lab3(){
        // Завдання №1
        task1();

        // Завдання №2
        task2();

        // Завдання №3
        task3();

        // Завдання №4
        task4();

        // Завдання №5
        task5();
    }

    // Метод для виконання завдання №1
    public static void task1() {
        System.out.println("Результат виконання завдання №1 "); // Виводимо текст на консоль

        // Введення фрази користувачем
        System.out.println("Введіть фразу:");
        String phrase = Main.sc.nextLine(); // Зчитуємо введену користувачем фразу

        // Виведення фрази за допомогою циклу for
        System.out.println("Виведення за допомогою циклу for:");
        for (int i = 0; i < 50; i++) { // Виконуємо цикл 50 разів
            System.out.println(phrase); // Виводимо фразу на консоль
        }

        // Виведення фрази за допомогою циклу while
        System.out.println("Виведення за допомогою циклу while:");
        int count = 0;
        while (count < 50) { // Поки лічильник менший за 50
            System.out.println(phrase); // Виводимо фразу на консоль
            count++; // Збільшуємо лічильник
        }
    }

    // Метод для виконання завдання №2
    public static void task2() {
        System.out.println("Результат виконання завдання №2 "); // Виводимо текст на консоль
        for (int hour = 0; hour < 3; hour++) { // Вкладений цикл для годин (від 0 до 2)
            for (int minute = 0; minute < 60; minute++) { // Вкладений цикл для хвилин (від 0 до 59)
                System.out.println(hour + " h " + minute + " min"); // Виведення годин та хвилин на консоль
            }
        }
    }

    // Метод для виконання завдання №3
    public static void task3() {
        int hour = 0; // Ініціалізуємо змінну для годин
        while (hour < 3) { // Зовнішній цикл для годин (виконується, поки година менше 3)
            int minute = 0; // Ініціалізуємо змінну для хвилин
            while (minute < 60) { // Вкладений цикл для хвилин (виконується, поки хвилина менше 60)
                System.out.println(hour + " h " + minute + " min"); // Виводимо годину і хвилину
                minute++; // Збільшуємо значення хвилин на 1
            }
            hour++; // Збільшуємо значення годин на 1 після завершення ітерації хвилин
        }
    }

    // Метод для виконання завдання №4
    public static void task4() {
        System.out.println("Результат виконання завдання №4 "); // Виводимо текст на консоль
        for (int hour = 0; hour < 3; hour++) { // Вкладений цикл для годин (від 0 до 2)
            for (int minute = 0; minute < 60; minute++) { // Вкладений цикл для хвилин (від 0 до 59)
                for (int second = 0; second < 60; second++) { // Вкладений цикл для секунд (від 0 до 59)
                    System.out.println(hour + " h " + minute + " min " + second + " sec"); // Виведення годин, хвилин та секунд на консоль
                }
            }
        }
    }

    // Метод для виконання завдання №5
    public static void task5() {

        // Запит на введення початкової точки інтервалу
        System.out.print("Введіть початкову точку інтервалу: ");
        double start = Main.sc.nextDouble();

        // Запит на введення кінцевої точки інтервалу
        System.out.print("Введіть кінцеву точку інтервалу: ");
        double end = Main.sc.nextDouble();

        // Запит на введення кроку
        System.out.print("Введіть крок: ");
        double step = Main.sc.nextDouble();

        // Ініціалізація лічильника кількості значень функції у вказаному діапазоні
        int count = 0;

        // Використання циклу for для обчислення та виведення значень функції
        System.out.println("За допомогою циклу for:");
        for (double x = start; x <= end; x += step) {
            double y = f(x); // Виклик функції f для обчислення значення функції при даному x
            System.out.println("f(" + x + ") = " + y); // Виведення результату
            if (y >= start && y <= end) { // Перевірка, чи значення функції потрапляє у вказаний діапазон
                count++; // Якщо так, збільшуємо лічильник
            }
        }
        printResult(count); // Виведення результату після використання циклу for

        // Використання циклу while для обчислення та виведення значень функції
        System.out.println("За допомогою циклу while:");
        double x = start; // Ініціалізація x значенням початкової точки інтервалу
        while (x <= end) {
            double y = f(x); // Виклик функції f для обчислення значення функції при даному x
            System.out.println("f(" + x + ") = " + y); // Виведення результату
            if (y >= start && y <= end) { // Перевірка, чи значення функції потрапляє у вказаний діапазон
                count++; // Якщо так, збільшуємо лічильник
            }
            x += step; // Збільшуємо x на крок
        }
        printResult(count); // Виведення результату після використання циклу while
    }

    // Функція для обчислення значення функції для заданого x
    public static double f(double x) {
        return (0.1 * Math.pow(x, 2) - x * Math.cos(x)); // Повертаємо результат обчислення функції
    }

    // Функція для виведення результату
    public static void printResult(int count) {
        if (count == 0) { // Якщо кількість значень функції у вказаному діапазоні дорівнює 0
            System.out.println("Значень функції в заданому діапазоні немає");
        } else { // В іншому випадку
            System.out.println("Кількість значень функції в заданому діапазоні: " + count);
        }
    }
}